-- 1. Вивести повний список ДТП, які виникли з вини пішоходів за вказаний період з повними відомостями про них:
SELECT * 
FROM dbo.GetAccidentsByPedestrians('2020-01-01', '2025-04-01');

-- 2. Знайти місце, де сталася максимальна кількість ДТП:
SELECT dbo.GetMaxAccidentLocation() AS MaxAccidentLocation;

-- 3. Вивести повний список ДТП, на які виїжджали міліціонери із зазначеним званням за вказаний період часу, з повними відомостями про ДТП:
SELECT * 
FROM dbo.GetAccidentsWithPoliceInvolvement('2020-01-01', '2025-04-01', 'Captain');

-- 4. Скласти список водіїв, які брали участь більше ніж в одній ДТП за зазначений період часу з повними відомостями про цих водіїв:
SELECT * 
FROM dbo.GetDriversWithMultipleAccidents('2020-01-01', '2025-04-01');

-- 5. Скласти список постраждалих у ДТП за вказаний період часу з повними відомостями про ці ДТП, упорядковані за кількістю травм певного виду:
SELECT * 
FROM dbo.GetAccidentVictimsByInjuryType('2020-01-01', '2025-04-01')
ORDER BY Injury_Type, Severity DESC;



